tutorials/lagrangian/reactingParcelFilmFoam/splashPanel/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         reactingMixture;
    transport       sutherland;
    thermo          janaf;
    energy          sensibleEnthalpy;
    equationOfState perfectGas;
    specie          specie;
}

chemistryReader foamChemistryReader;

foamChemistryFile "$FOAM_CASE/constant/foam.inp";

foamChemistryThermoFile "$FOAM_CASE/constant/foam.dat";

inertSpecie     N2;

liquids
{
    H2O
    {
        defaultCoeffs   yes;
    }
}

solids
{
    // none
}


// ************************************************************************* //
